<template>
  <div id="app">
    <v-carousel
    :slideItems="slideItems"
    />
  </div>
</template>

<script>
import vCarousel from './components/v-carousel.vue'

export default {
  name: 'App',
  data(){
    return{
      slideItems:[
        {id: 1,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Ким и Валерия Брейтбурги написали книгу про искусство",
        content: "Работа над книгой велась более пяти лет, и действенные методики, описанные в ней, созданные в результате анализа и синтеза идей…"},
        {id: 2,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Юрий Колокольников пытается спасти Землю в клипе «Космические силы»",
        content: "Премьера клипа «Космические силы» группы «Мумий Тролль» состоялась 6 ноября 2020 года."},
        {id: 3,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "BTS получили четыре награды MTV EMA",
        content: "BTS получили четыре награды MTV EMA 27-я ежегодная церемония награждения MTV Europe Music Awards состоялась 8 ноября 2020 г."},
        {id: 4,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Открытие сезона «Ла Скала» отменено",
        content: "Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."},
        {id: 5,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Хави не едет с «Барсой» в США. Тренеру отказали в спецразрешении...",
        content: "Тренера «Барселоны» Хави не пустили в США из-за посещения Ирана.Каталонцы в ближайшее время отправятся в США в предсезонное турне."},
        {id: 6,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Сладкоежек смутило мороженое, которое не тает даже при самой жаркой погоде",
        content: "Компания «Zhong xue gao» (Китай) известна своими лакомствами премиум-класса, но очередная новинка этой фирмы привлекла плохое внимание."},
        {id: 7,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Путешественник совершил самый короткий авиаперелёт между двумя островами",
        content: "Ноэль Филипс, который ведёт блог о путешествиях, совершил самый короткий авиаперелёт между двумя островами — Папа-Уэстрей и Уэстрей"},
        {id: 8,
        img: "img1.png",
        date: "10.11.2020 г.",
        name: "Самый большой шахматный король неофициально побил мировой рекорд",
        content: "Члены шахматного клуба из Саутрона (Франция) сделали шахматную фигуру, которой смог бы поиграть разве что великан."}
      ]
    }
  },
  components: {
    vCarousel
  }
}
</script>

<style>
.app {
  width: 100%;
  height: 100%;
  position: absolute;
  top: 0;
  left: 0;
  overflow: auto;
}
* {
	-webkit-user-select: none;
	-khtml-user-select: none;
	-moz-user-select: none;
	-ms-user-select: none;
	user-select: none;
}
</style>
